#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/calyptia/fluent-bit-infra/runs/run-yoPxwe3FYWXzZuSZ

Waiting for the plan to start...

Terraform v0.14.7
Initializing plugins and modules...
metal_ssh_key.packages-fluent-bit-provision-ssh-pub-key: Refreshing state... [id=5131769d-0e6d-4e21-88d6-8df3c7ae44cc]
tls_private_key.gh-runner-provision-key: Refreshing state... [id=7d2b71a947985b05873fa16c3f290a2aeca67a6c]
tls_private_key.packages-fluent-bit-provision-key: Refreshing state... [id=6c219aa91d923b0064783e1c1b1973dcab23b2fb]
metal_device.packages-fluent-bit: Refreshing state... [id=c45acc51-40ac-4b32-9c58-cbd65a342fbe]
metal_ssh_key.gh-runner-provision-ssh-pub-key: Refreshing state... [id=4d238aaf-11fe-4afb-9e9b-34ffb4bec56d]
google_compute_disk.test-data: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/disks/test-data]
google_compute_address.static: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/addresses/ipv4-address]
google_compute_network.default-services: Refreshing state... [id=projects/fluent-bit-ci/global/networks/default-public-svc-network]
google_compute_disk.test-data-01: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/disks/test-data-01]
google_compute_address.static-01: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/addresses/ipv4-address-01]
github_repository.fluent-bit-unstable-releases: Refreshing state... [id=fluent-bit-unstable-releases]
github_team.fluent-bit-sandbox-maintainers: Refreshing state... [id=5969310]
github_repository.fluent-bit-sandbox: Refreshing state... [id=fluent-bit-sandbox]
metal_device.gh-runners["arm64"]: Refreshing state... [id=ec1f3769-1331-4be1-8207-81688e4f2696]
metal_device.gh-runners["x64"]: Refreshing state... [id=47b71ede-1401-4f41-857d-b83215e52621]
cloudflare_record.backup: Refreshing state... [id=67c3eccf0a0834b01884701016dffd8a]
cloudflare_record.test: Refreshing state... [id=f861ed655d4ed62b4c19c82de120179c]
cloudflare_record.www: Refreshing state... [id=962890f07d1facb9c4f95f71c0dadbac]
cloudflare_record.docs: Refreshing state... [id=e2ca6fd8bc5ac015448c741d0b850e61]
cloudflare_record.fluentd-config-validator: Refreshing state... [id=a683b867e465952b0a41ddbeb8a464c8]
cloudflare_record.root-www: Refreshing state... [id=d09f8846b7b52cbd89011619edf8dc7d]
cloudflare_record.config-validator: Refreshing state... [id=4e3cd831fb498c19cad0e1c4f30d800e]
cloudflare_record.cloud-monitoring-api-dev: Refreshing state... [id=b733bf55decf54e7cd37bdc6bbcef130]
cloudflare_record.www-old: Refreshing state... [id=63d899fe0abd52851193cbed706a58d4]
cloudflare_record.registry: Refreshing state... [id=c8896e619f5c0ace02059e0457c23ffe]
cloudflare_record.fluentd-config-validator-dev: Refreshing state... [id=954fec0843bf6cc062a6aabd9c9e1811]
cloudflare_record.short-registry: Refreshing state... [id=c4a4f01a2be5fea4c8a7b20bc28a85fe]
cloudflare_record.packages-test: Refreshing state... [id=f0ec9c52b66c208dadbf5569d333f188]
cloudflare_page_rule.downloads-fluentbitio: Refreshing state... [id=34ebbbf674a600e76a0ea6a2b91d975d]
cloudflare_record.config-validator-dev: Refreshing state... [id=8a57626a631ddc89017f20c11a3b9ce4]
cloudflare_page_rule.docs-fluentbitio: Refreshing state... [id=9b028036a9507ab028b1b49809572732]
cloudflare_page_rule.releases-fluentbitio: Refreshing state... [id=1bbac17c5d0bcd0da6e779361ec5ca41]
google_compute_firewall.ssh_default: Refreshing state... [id=projects/fluent-bit-ci/global/firewalls/default-public-svc-ssh]
google_compute_subnetwork.default-services-subnet: Refreshing state... [id=projects/fluent-bit-ci/regions/us-east1/subnetworks/default-public-svc-subnet]
null_resource.packages-fluent-bit-provision: Refreshing state... [id=1765289122180499844]
github_branch.mirror-main-branch: Refreshing state... [id=fluent-bit-mirror:mirror-main]
github_branch_protection_v3.fluent-bit-unstable-releases: Refreshing state... [id=fluent-bit-unstable-releases:main]
cloudflare_record.legacy-server: Refreshing state... [id=182111a207d70486ee95e4d2b160e92f]
cloudflare_record.packages: Refreshing state... [id=f7ce9c8999d7f4fa812ff1176543e81e]
cloudflare_record.apt: Refreshing state... [id=5ca012769dedb027234bdb0e96c2fead]
cloudflare_record.gh-runners["arm64"]: Refreshing state... [id=6f2f6feb5e03e0729f2d0b071ccfb07a]
cloudflare_record.gh-runners["x64"]: Refreshing state... [id=50337bb3f462f47a3135bdff3e2e9d35]
cloudflare_record.legacy-releases: Refreshing state... [id=7b3866176a8e15b107c9a6f3504cf441]
cloudflare_record.test-subdomain: Refreshing state... [id=99f3293646a1f4f35772245bbbe873bc]
null_resource.gh-runners-provision["x64"]: Refreshing state... [id=4138320923887792658]
null_resource.gh-runners-provision["arm64"]: Refreshing state... [id=5869905610083058987]
github_team_membership.fluent-bit-sandbox-maintainers["niedbalski"]: Refreshing state... [id=5969310:niedbalski]
github_team_membership.fluent-bit-sandbox-maintainers["patrick-stephens"]: Refreshing state... [id=5969310:patrick-stephens]
github_team_membership.fluent-bit-sandbox-maintainers["agup006"]: Refreshing state... [id=5969310:agup006]
github_team_membership.fluent-bit-sandbox-maintainers["edsiper"]: Refreshing state... [id=5969310:edsiper]
github_branch_protection_v3.fluent-bit-sandbox: Refreshing state... [id=fluent-bit-sandbox:main]
github_repository_environment.unstable-environment: Refreshing state... [id=fluent-bit:unstable]
github_branch_protection_v3.default-branch-protection["1.8"]: Refreshing state... [id=fluent-bit:1.8]
github_actions_secret.appveyor_account: Refreshing state... [id=fluent-bit:APPVEYOR_ACCOUNT]
github_branch_protection_v3.default-branch-protection["1.9"]: Refreshing state... [id=fluent-bit:1.9]
github_branch_protection_v3.default-branch-protection["master"]: Refreshing state... [id=fluent-bit:master]
github_repository_environment.staging-environment: Refreshing state... [id=fluent-bit:staging]
github_team_repository.fluent-bit-sandbox-maintainers: Refreshing state... [id=5969310:fluent-bit-sandbox]
github_actions_secret.appveyor_token: Refreshing state... [id=fluent-bit:APPVEYOR_TOKEN]
github_branch_default.mirror-default-branch: Refreshing state... [id=fluent-bit-mirror]
github_repository_environment.release-environment: Refreshing state... [id=fluent-bit:release]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_CLIENT_ID]
github_actions_secret.fluent-bit-ci-azure-client-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_CLIENT_ID]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_CLIENT_SECRET]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_CLIENT_SECRET]
github_actions_secret.ffluent-bit-ci-azure-client-secret["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_CLIENT_SECRET]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-tenant-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_TENANT_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit"]: Refreshing state... [id=fluent-bit:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-azure-subscription-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:AZURE_SUBSCRIPTION_ID]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-password["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_ADMIN_PASSWORD]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_AWS_ACCESS_ID]
github_actions_secret.fluent-bit-ci-opensearch-aws-access-id["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_AWS_ACCESS_ID]
google_compute_instance.long-running-test-01: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/instances/long-running-test-01]
google_compute_instance.long-running-test: Refreshing state... [id=projects/fluent-bit-ci/zones/us-east1-c/instances/long-running-test]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit-ci"]: Refreshing state... [id=fluent-bit-ci:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit"]: Refreshing state... [id=fluent-bit:OPENSEARCH_AWS_SECRET_KEY]
github_actions_secret.fluent-bit-ci-opensearch-aws-secret-key["fluent-bit-mirror"]: Refreshing state... [id=fluent-bit-mirror:OPENSEARCH_AWS_SECRET_KEY]
github_actions_environment_secret.unstable-release-repos["staging"]: Refreshing state... [id=fluent-bit:staging:RELEASE_REPO]
github_actions_environment_secret.unstable-release-repos["unstable"]: Refreshing state... [id=fluent-bit:unstable:RELEASE_REPO]
github_actions_environment_secret.staging-aws-access-key-id-secret: Refreshing state... [id=fluent-bit:staging:AWS_ACCESS_KEY_ID]
github_actions_environment_secret.staging-aws-secret-access-key-secret: Refreshing state... [id=fluent-bit:staging:AWS_SECRET_ACCESS_KEY]
github_actions_environment_secret.staging-bucket-secret: Refreshing state... [id=fluent-bit:staging:AWS_S3_BUCKET_STAGING]
github_actions_environment_secret.staging-gpg-private-key-passphrase-secret: Refreshing state... [id=fluent-bit:staging:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_environment_secret.staging-gpg-private-key-secret: Refreshing state... [id=fluent-bit:staging:GPG_PRIVATE_KEY]
github_actions_environment_secret.unstable-release-tokens["unstable"]: Refreshing state... [id=fluent-bit:unstable:RELEASE_TOKEN]
github_actions_environment_secret.unstable-release-tokens["staging"]: Refreshing state... [id=fluent-bit:staging:RELEASE_TOKEN]
github_actions_environment_secret.release-aws-access-key-id-secret: Refreshing state... [id=fluent-bit:release:AWS_ACCESS_KEY_ID]
github_actions_environment_secret.release-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_RELEASE]
github_actions_environment_secret.release-gpg-private-key-secret: Refreshing state... [id=fluent-bit:release:GPG_PRIVATE_KEY]
github_actions_environment_secret.release-staging-bucket-secret: Refreshing state... [id=fluent-bit:release:AWS_S3_BUCKET_STAGING]
github_actions_environment_secret.release-aws-secret-access-key-secret: Refreshing state... [id=fluent-bit:release:AWS_SECRET_ACCESS_KEY]
github_actions_environment_secret.release-dockerhub-org: Refreshing state... [id=fluent-bit:release:DOCKERHUB_ORGANIZATION]
github_actions_environment_secret.release-server-sshkey: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_SSHKEY]
github_actions_environment_secret.release-server-hostname: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_HOST]
github_actions_environment_secret.release-cosign-private-key: Refreshing state... [id=fluent-bit:release:COSIGN_PRIVATE_KEY]
github_actions_environment_secret.release-dockerhub-username: Refreshing state... [id=fluent-bit:release:DOCKERHUB_USERNAME]
github_actions_environment_secret.release-dockerhub-token: Refreshing state... [id=fluent-bit:release:DOCKERHUB_TOKEN]
github_actions_environment_secret.release-server-username: Refreshing state... [id=fluent-bit:release:FLUENTBITIO_USERNAME]
github_actions_environment_secret.release-gpg-private-key-passphrase-secret: Refreshing state... [id=fluent-bit:release:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_HOST"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_HOST]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_USERNAME"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_USERNAME]
github_actions_secret.mirror-release-secrets["AWS_S3_BUCKET_STAGING"]: Refreshing state... [id=fluent-bit-mirror:AWS_S3_BUCKET_STAGING]
github_actions_secret.mirror-release-secrets["DOCKERHUB_USERNAME"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_USERNAME]
github_actions_secret.mirror-release-secrets["GPG_PRIVATE_KEY_PASSPHRASE"]: Refreshing state... [id=fluent-bit-mirror:GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.mirror-release-secrets["AWS_SECRET_ACCESS_KEY"]: Refreshing state... [id=fluent-bit-mirror:AWS_SECRET_ACCESS_KEY]
github_actions_secret.mirror-release-secrets["COSIGN_PRIVATE_KEY"]: Refreshing state... [id=fluent-bit-mirror:COSIGN_PRIVATE_KEY]
github_actions_secret.mirror-release-secrets["DOCKERHUB_ORGANIZATION"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_ORGANIZATION]
github_actions_secret.mirror-release-secrets["DOCKERHUB_TOKEN"]: Refreshing state... [id=fluent-bit-mirror:DOCKERHUB_TOKEN]
github_actions_secret.mirror-release-secrets["GPG_PRIVATE_KEY"]: Refreshing state... [id=fluent-bit-mirror:GPG_PRIVATE_KEY]
github_actions_secret.mirror-release-secrets["FLUENTBITIO_SSHKEY"]: Refreshing state... [id=fluent-bit-mirror:FLUENTBITIO_SSHKEY]
github_actions_secret.mirror-release-secrets["AWS_S3_BUCKET_RELEASE"]: Refreshing state... [id=fluent-bit-mirror:AWS_S3_BUCKET_RELEASE]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # metal_device.packages-fluent-bit will be created
  + resource "metal_device" "packages-fluent-bit" {
      + access_private_ipv4              = (known after apply)
      + access_public_ipv4               = (known after apply)
      + access_public_ipv6               = (known after apply)
      + always_pxe                       = false
      + billing_cycle                    = "hourly"
      + created                          = (known after apply)
      + deployed_facility                = (known after apply)
      + deployed_hardware_reservation_id = (known after apply)
      + force_detach_volumes             = false
      + hostname                         = "packages-managed.fluentbit.io"
      + id                               = (known after apply)
      + locked                           = (known after apply)
      + metro                            = "da"
      + network                          = (known after apply)
      + network_type                     = (known after apply)
      + operating_system                 = "ubuntu_20_04"
      + plan                             = "c3.small.x86"
      + ports                            = (known after apply)
      + project_id                       = "25d09386-ae25-4259-a239-f8c5e14a3c0e"
      + root_password                    = (sensitive value)
      + ssh_key_ids                      = (known after apply)
      + state                            = (known after apply)
      + updated                          = (known after apply)
      + user_data                        = (sensitive value)
      + wait_for_reservation_deprovision = false
    }

  # metal_ssh_key.packages-fluent-bit-provision-ssh-pub-key will be destroyed
  - resource "metal_ssh_key" "packages-fluent-bit-provision-ssh-pub-key" {
      - created     = "2023-01-10T09:38:08Z" -> null
      - fingerprint = "90:ee:78:a6:05:c0:1c:23:08:89:0a:5b:b9:f0:12:4d" -> null
      - id          = "5131769d-0e6d-4e21-88d6-8df3c7ae44cc" -> null
      - name        = "packages-fluent-bit-provision-ssh-pub-key" -> null
      - owner_id    = "25d09386-ae25-4259-a239-f8c5e14a3c0e" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCzRUI3cZrZjQjhjN+dZC2Fuo9JP4D2/f80BLcGa+JOkbyD7LGbRaDVs3iceL50nM5xJGYsBwX4CUbFtBtZ2j6rmPHeFKV0Ccp9UiDCHmHLkw5ljjxAjWEnfZ6l4UjF3/dpVkOwPkle2rhFonY7K14nGWbVACcS5WI5ky+BXNNPhHNdJ1I9bUwU+ee7OOXczVMARlye6sThjlEputPNAELgs8FRWhP4F85qouxE+pwFYKg+PRh3NFEKDA86XM2NbQO66mnJXFAT+qrk9fRvD+ItRa88UdXcRDWzQzPnAJ646zktoL4tbsTwNGfR5ypQkseyCW6DMqX+BpLgkdcuVK84juZ/FxDvblgCeEhNCBY3bybeUVIzDdW31uLea7WaowWFnhMm0nmwnU4oTTZzz56LoRtfBILzE8ALGIiGiaZL+QiC9sOiuU500AMenoTiuucoa0H+WHrZ/LfWWS15g1tx8CuOJf374WepQ3KRKKV9BneeyjYmTHZXTUk02+PfYHe6hng3VtKMJY1Nm6XvRAsTPaq7YUY0FBV6pqgDl1uG3APOPUN1rfnT91KKZn7JX6tYeO9nks0VjHYQrvKEayAh1sMMTMUFn8Tz/+/rVoZl9obt8ykfdU2/GUGbrtVyzFIXZrWf+brGsNi7/lNL/2Nub2+ucjouGltj/onwAs+iAQ==" -> null
      - updated     = "2023-01-10T09:41:28Z" -> null
    }

  # null_resource.packages-fluent-bit-provision is tainted, so must be replaced
-/+ resource "null_resource" "packages-fluent-bit-provision" {
      ~ id = "1765289122180499844" -> (known after apply)
    }

  # tls_private_key.packages-fluent-bit-provision-key will be destroyed
  - resource "tls_private_key" "packages-fluent-bit-provision-key" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "6c219aa91d923b0064783e1c1b1973dcab23b2fb" -> null
      - private_key_openssh           = (sensitive value)
      - private_key_pem               = (sensitive value)
      - private_key_pem_pkcs8         = (sensitive value)
      - public_key_fingerprint_md5    = "90:ee:78:a6:05:c0:1c:23:08:89:0a:5b:b9:f0:12:4d" -> null
      - public_key_fingerprint_sha256 = "SHA256:A1zaVQiHB6YCqL+eA05fitIqU8j3egjpqgpHCQIx/HA" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCzRUI3cZrZjQjhjN+dZC2Fuo9JP4D2/f80BLcGa+JOkbyD7LGbRaDVs3iceL50nM5xJGYsBwX4CUbFtBtZ2j6rmPHeFKV0Ccp9UiDCHmHLkw5ljjxAjWEnfZ6l4UjF3/dpVkOwPkle2rhFonY7K14nGWbVACcS5WI5ky+BXNNPhHNdJ1I9bUwU+ee7OOXczVMARlye6sThjlEputPNAELgs8FRWhP4F85qouxE+pwFYKg+PRh3NFEKDA86XM2NbQO66mnJXFAT+qrk9fRvD+ItRa88UdXcRDWzQzPnAJ646zktoL4tbsTwNGfR5ypQkseyCW6DMqX+BpLgkdcuVK84juZ/FxDvblgCeEhNCBY3bybeUVIzDdW31uLea7WaowWFnhMm0nmwnU4oTTZzz56LoRtfBILzE8ALGIiGiaZL+QiC9sOiuU500AMenoTiuucoa0H+WHrZ/LfWWS15g1tx8CuOJf374WepQ3KRKKV9BneeyjYmTHZXTUk02+PfYHe6hng3VtKMJY1Nm6XvRAsTPaq7YUY0FBV6pqgDl1uG3APOPUN1rfnT91KKZn7JX6tYeO9nks0VjHYQrvKEayAh1sMMTMUFn8Tz/+/rVoZl9obt8ykfdU2/GUGbrtVyzFIXZrWf+brGsNi7/lNL/2Nub2+ucjouGltj/onwAs+iAQ==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAs0VCN3Ga2Y0I4YzfnWQt
            hbqPST+A9v3/NAS3BmviTpG8g+yxm0Wg1bN4nHi+dJzOcSRmLAcF+AlGxbQbWdo+
            q5jx3hSldAnKfVIgwh5hy5MOZY48QI1hJ32epeFIxd/3aVZDsD5JXtq4RaJ2Oyte
            Jxlm1QAnEuViOZMvgVzTT4RzXSdSPW1MFPnnuzjl3M1TAEZcnurE4Y5RKbrTzQBC
            4LPBUVoT+BfOaqLsRPqcBWCoPj0YdzRRCgwPOlzNjW0DuuppyVxQE/qq5PX0bw/i
            LUWvPFHV3EQ1s0Mz5wCeuOs5LaC+LW7E8DRn0ecqUJLHsglugzKl/gaS4JHXLlSv
            OI7mfxcQ725YAnhITQgWN28m3lFSMw3Vt9bi3mu1mqMFhZ4TJtJ5sJ1OKE02c8+e
            i6EbXwSC8xPACxiIhommS/kIgvbDorlOdNADHp6E4rrnKGtB/lh62fy31lkteYNb
            cfArjiX9++FnqUNykSilfQZ3nso2Jkx2V01JNNvj32B3uoZ4N1bSjCWNTZul70QL
            Ez2qu2FGNBQVeqaoA5dbhtwDzj1Dda350/dSimZ+yV+rWHjvZ5LNFYx2EK7yhGsg
            IdbDDEzFBZ/E8//v61aGZfaG7fMpH3VNvxlBm67VcsxSF2a1n/m6xrDYu/5TS/9j
            bm9vrnI6LhpbY/6J8ALPogECAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 2 to add, 0 to change, 3 to destroy.

Warning: Deprecated Resource

  on machines.tf line 5, in data "metal_device" "legacy_www":
   5: data "metal_device" "legacy_www" {

Equinix Metal Provider is now Deprecated (End-of-Life scheduled for July 1,
2023) meaning that this software is only supported or maintained by Equinix
Metal and its community in a case-by-case basis. The Equinix provider
(https://registry.terraform.io/providers/equinix/equinix/latest/docs) has full
support for existing Terraform managed Metal resources once Terraform
configuration and state are adapted. The Equinix provider manages resources
including Network Edge and Fabric in addition to Metal. Please review the
Metal to Equinix provider migration guide:
https://registry.terraform.io/providers/equinix/equinix/latest/docs/guides/migration_guide_equinix_metal

(and 3 more similar warnings elsewhere)


```
</details>
*Pushed by: @patrick-stephens, Action: `pull_request`*